lfazio/rv32cortex-m/src/platform/stm32f746/main.c
/* SPDX-License-Identifier: Apache-2.0 */
/*
 * main.c - RV32 emulator firmware for the Nucleo-F746ZG.
 *
 * Bring-up is done entirely with ST's own driver pack: the CMSIS device
 * headers for register definitions, ST's startup file and
 * system_stm32f7xx.c, and the STM32Cube HAL for the clock tree, GPIO and
 * USART. Nothing here reimplements a peripheral the vendor already
 * supports.
 *
 * What this file adds is the glue: a guest address space built out of ARM
 * memory and ARM peripherals, and a run loop that hands control back often
 * enough for the ARM side to keep servicing its own interrupts.
 */

#include "stm32f7xx_hal.h"

#include "rv32/rv_backend.h"
#include "rv32/rv_dev.h"
#include "rv32/rv_aplic.h"
#include "rv32/rv_hart.h"
#include "rv32/rv_jit.h"
#include "rv32/rv_memmap.h"

#include <string.h>

/* The guest binary, embedded by guest_image.S. */
extern const uint8_t rv_guest_image[];
extern const uint32_t rv_guest_image_size;

/* ------------------------------------------------------------------ */
/* Configuration                                                       */
/* ------------------------------------------------------------------ */

/*
 * Guest RAM is not a fixed-size array: the link script places it between
 * the firmware's .bss and the stack and gives it everything in between, so
 * the guest automatically receives all the SRAM the ARM side is not using
 * (see .guest_ram in stm32f746retx.ld).
 */
extern uint8_t __guest_ram_start[];
extern uint8_t __guest_ram_end[];

#define GUEST_RAM_BASE_PTR  (__guest_ram_start)
#define GUEST_RAM_SIZE      ((uint32_t)(__guest_ram_end - __guest_ram_start))

/* CLINT mtime runs at 1 MHz, derived from the DWT cycle counter. */
#define RV_CLINT_HZ         1000000u

/* Instructions executed between returns to the ARM side. */
#ifndef RV_RUN_SLICE
#define RV_RUN_SLICE        4096u
#endif

/* ------------------------------------------------------------------ */
/* State                                                               */
/* ------------------------------------------------------------------ */

#if RV_ENABLE_JIT
/*
 * Code cache for translated blocks. Ordinary .bss: the ARMv7-M default
 * memory map makes SRAM executable, so no MPU work is needed. This comes
 * out of what the guest would otherwise get, which is the trade the JIT
 * asks for.
 */
static uint8_t g_jit_code[RV_JIT_CODE_SIZE] __attribute__((aligned(8)));
#endif

static rv_bus_t    g_bus;
static rv_hart_t   g_hart;
static rv_clint_t  g_clint;
static rv_aplic_t  g_aplic;
static rv_uart_t   g_uart;
static UART_HandleTypeDef g_console;

/* ------------------------------------------------------------------ */
/* Console                                                             */
/* ------------------------------------------------------------------ */

void rv_console_putc(uint8_t c)
{
    /* Blocking, with a generous timeout: output is for humans, and losing
     * a byte is worse than stalling briefly. */
    HAL_UART_Transmit(&g_console, &c, 1u, 100u);
}

#define console_putc rv_console_putc

static void console_puts(const char *s)
{
    while (*s != '\0') {
        if (*s == '\n') {
            console_putc('\r');   /* terminals expect CRLF */
        }
        console_putc((uint8_t)*s++);
    }
}

static void console_puthex(uint32_t v)
{
    static const char hex[] = "0123456789abcdef";
    console_puts("0x");
    for (int i = 28; i >= 0; i -= 4) {
        console_putc((uint8_t)hex[(v >> i) & 0xFu]);
    }
}

static void console_putu(uint32_t v)
{
    char tmp[10];
    unsigned n = 0;
    do {
        tmp[n++] = (char)('0' + (v % 10u));
        v /= 10u;
    } while (v != 0u);
    while (n != 0u) {
        console_putc((uint8_t)tmp[--n]);
    }
}

/* Transport hooks for the guest's virtual UART. */
static void guest_uart_tx(void *ctx, uint8_t c)
{
    (void)ctx;
    if (c == '\n') {
        console_putc('\r');
    }
    console_putc(c);
}

static int guest_uart_rx(void *ctx)
{
    (void)ctx;
    /*
     * Non-blocking poll of the receive data register.
     *
     * RDR, not DR: this family splits the F4's single data register into
     * separate receive and transmit halves, so the F4 spelling does not
     * compile rather than quietly reading the wrong thing -- the one kind
     * of porting difference that costs nothing to find.
     */
    if (__HAL_UART_GET_FLAG(&g_console, UART_FLAG_RXNE)) {
        return (int)(g_console.Instance->RDR & 0xFFu);
    }
    return -1;
}

/* ------------------------------------------------------------------ */
/* ECALL services                                                      */
/* ------------------------------------------------------------------ */

/*
 * The same newlib-style calls the host runner implements, so a guest built
 * once behaves identically in both places. Anything else falls through to
 * a normal M-mode trap, leaving guests with their own handler unaffected.
 *
 *   a7 = 64  write(fd, buf, len)
 *   a7 = 93  exit(code)
 */
#define REG_A0  10
#define REG_A1  11
#define REG_A2  12
#define REG_A7  17

static uint32_t g_exit_code;
static bool     g_exited;

static bool guest_ecall(rv_hart_t *h, void *user)
{
    (void)user;

    switch (h->x[REG_A7]) {
    case 64: {
        const uint32_t buf = h->x[REG_A1];
        const uint32_t len = h->x[REG_A2];
        for (uint32_t i = 0; i < len; i++) {
            uint32_t byte;
            if (rv_bus_read(h->bus, buf + i, 1u, &byte) != RV_EXC_NONE) {
                break;
            }
            guest_uart_tx(NULL, (uint8_t)byte);
        }
        h->x[REG_A0] = len;
        return true;
    }

    case 93:
        g_exit_code = h->x[REG_A0];
        g_exited = true;
        h->state = RV_STATE_HALTED;
        return true;

    default:
        return false;
    }
}

/* ------------------------------------------------------------------ */
/* Cache maintenance                                                   */
/* ------------------------------------------------------------------ */

