lfazio/rv32cortex-m/src/platform/stm32f746/main.c
/*
 * Zicbom mapped onto ARMv7-M cache maintenance.
 *
 * The Cortex-M7 in the STM32F746 has both caches, so unlike on the F446 --
 * where every one of these was a no-op the spec explicitly permits -- these
 * are real operations on the lines backing the guest's block. A guest that
 * hands a buffer to DMA and skips the cbo is now wrong in a way it was not
 * on the M4, which is the honest consequence of the part having a cache
 * rather than something the emulator should paper over.
 */
static void arm_cache_maint(void *ctx, void *host, uint32_t len,
                            rv_cbo_op_t op)
{
    (void)ctx;

#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
    switch (op) {
    case RV_CBO_CLEAN:
        SCB_CleanDCache_by_Addr((uint32_t *)host, (int32_t)len);
        break;
    case RV_CBO_INVAL:
        SCB_InvalidateDCache_by_Addr((uint32_t *)host, (int32_t)len);
        break;
    case RV_CBO_FLUSH:
        SCB_CleanInvalidateDCache_by_Addr((uint32_t *)host, (int32_t)len);
        break;
    }
#else
    (void)host;
    (void)len;
    (void)op;
    /* No data cache on this part: nothing to maintain. */
#endif
}

static const rv_cache_ops_t g_cache_ops = {
    .maint = arm_cache_maint,
    .ctx = NULL,
};

/* ------------------------------------------------------------------ */
/* Cycle counter                                                       */
/* ------------------------------------------------------------------ */

static void dwt_init(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;

    /*
     * Unlock the DWT before touching it. ARMv7-M gives the trace blocks an
     * optional software lock, and the Cortex-M7 implements it where the
     * Cortex-M4 does not: with the lock engaged, writes to CTRL and CYCCNT
     * are discarded silently, so the cycle counter simply never runs and
     * everything built on it -- the CLINT's mtime, and therefore every
     * guest timer interrupt -- stops without an error anywhere.
     *
     * The magic constant is architectural. Writing it to a part with no
     * lock, or to one already unlocked by a debugger, does nothing, which
     * is why it is unconditional.
     */
    DWT->LAR = 0xC5ACCE55u;

    DWT->CYCCNT = 0u;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

static inline uint32_t dwt_cycles(void)
{
    return DWT->CYCCNT;
}

/* ------------------------------------------------------------------ */
/* Clock tree                                                          */
/* ------------------------------------------------------------------ */

static void Error_Handler(void)
{
    __disable_irq();
    for (;;) {
        /* A failure this early cannot be reported; halt so a debugger can
         * see where we stopped. */
    }
}

/*
 * 216 MHz from the internal 16 MHz HSI. HSI rather than HSE for the same
 * reason as on the F446: the ST-LINK MCO path depends on solder-bridge
 * options that vary between board revisions, and HSI works on an
 * unmodified board.
 *
 *   HSI 16 MHz / PLLM 8 = 2 MHz  -> x PLLN 216 = 432 MHz -> / PLLP 2 = 216 MHz
 *
 * PLLQ is 9 rather than 4 because the 48 MHz domain is derived from the
 * same 432 MHz VCO here (432/9), not from the 360 MHz one.
 */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef osc = { 0 };
    RCC_ClkInitTypeDef clk = { 0 };

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    osc.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    osc.HSIState = RCC_HSI_ON;
    osc.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    osc.PLL.PLLState = RCC_PLL_ON;
    osc.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    osc.PLL.PLLM = 8;
    osc.PLL.PLLN = 216;
    osc.PLL.PLLP = RCC_PLLP_DIV2;
    osc.PLL.PLLQ = 9;
    if (HAL_RCC_OscConfig(&osc) != HAL_OK) {
        Error_Handler();
    }

    /* Over-drive is mandatory above 180 MHz on this part. */
    if (HAL_PWREx_EnableOverDrive() != HAL_OK) {
        Error_Handler();
    }

    clk.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                    RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clk.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    clk.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clk.APB1CLKDivider = RCC_HCLK_DIV4;    /* 54 MHz, APB1 max */
    clk.APB2CLKDivider = RCC_HCLK_DIV2;    /* 108 MHz, APB2 max */
    /* 7 wait states: 216 MHz at the 2.7-3.6 V range of RM0385 Table 7. */
    if (HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_7) != HAL_OK) {
        Error_Handler();
    }

    /*
     * Peripheral kernel clocks, which the F4 clock tree does not have.
     *
     * On this family each USART selects its own source in DCKCFGR2 rather
     * than simply running from its APB clock, and the HAL computes the
     * baud-rate divisor from whichever source is selected. The reset value
     * is PCLK1, so the console would come up correctly without this -- and
     * would silently produce garbage the moment anything else touched
     * DCKCFGR2. Saying it costs one register write.
     */
    RCC_PeriphCLKInitTypeDef pclk = { 0 };
    pclk.PeriphClockSelection = RCC_PERIPHCLK_USART3;
    pclk.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&pclk) != HAL_OK) {
        Error_Handler();
    }
}

static void console_init(void)
{
    /*
     * USART3, not USART2. On a Nucleo-144 the ST-LINK virtual COM port is
     * wired to PD8/PD9; USART2 goes to the Arduino/ST Zio header instead,
     * so using it produces a board that runs and says nothing.
     */
    g_console.Instance = USART3;
    g_console.Init.BaudRate = 115200;
    g_console.Init.WordLength = UART_WORDLENGTH_8B;
    g_console.Init.StopBits = UART_STOPBITS_1;
    g_console.Init.Parity = UART_PARITY_NONE;
    g_console.Init.Mode = UART_MODE_TX_RX;
    g_console.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_console.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&g_console) != HAL_OK) {
        Error_Handler();
    }
}

/* Called by HAL_UART_Init. */
void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
    GPIO_InitTypeDef gpio = { 0 };

    if (huart->Instance != USART3) {
        return;
    }

    __HAL_RCC_USART3_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    /* PD8 = USART3_TX, PD9 = USART3_RX, both AF7. */
    gpio.Pin = GPIO_PIN_8 | GPIO_PIN_9;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF7_USART3;
    HAL_GPIO_Init(GPIOD, &gpio);
}

