lfazio/rv32cortex-m/src/platform/stm32f746/main.c
    rv_hart_reset(&g_hart, RV_GUEST_RESET_PC);
    rv_hart_boot(&g_hart, RV_GUEST_RAM_BASE, GUEST_RAM_SIZE);

    const uint32_t cycles_per_tick = SystemCoreClock / RV_CLINT_HZ;
    const uint32_t start_cycles = dwt_cycles();
    uint64_t retired_total = 0;

    for (;;) {
        uint32_t retired = 0;
        const rv_run_reason_t why = rv_run(&g_hart, RV_RUN_SLICE, &retired);
        retired_total += retired;

        /* Guest time tracks real time through the DWT cycle counter. */
        rv_clint_set_time(&g_clint,
                          (uint64_t)(dwt_cycles() - start_cycles) / cycles_per_tick);

        if (why == RV_RUN_HALTED) {
            break;
        }
        if (why == RV_RUN_WFI && g_hart.mie == 0u) {
            console_puts("\nguest parked in WFI with no interrupts enabled\n");
            break;
        }
    }

    const uint32_t elapsed = dwt_cycles() - start_cycles;

    console_puts("\n-- done --\n  retired  ");
    console_putu((uint32_t)retired_total);
    console_puts(" instructions\n  host     ");
    console_putu(elapsed);
    console_puts(" cycles\n  ratio    ");
    if (retired_total != 0u) {
        /* Host ARM cycles per emulated RISC-V instruction, x100 so the
         * fractional part survives integer division. */
        const uint32_t x100 = (uint32_t)((uint64_t)elapsed * 100u / retired_total);
        console_putu(x100 / 100u);
        console_putc('.');
        console_putu((x100 % 100u) / 10u);
        console_putu(x100 % 10u);
        console_puts(" host cycles per guest instruction\n  speed    ");
        const uint32_t kips =
            (uint32_t)((uint64_t)retired_total * (SystemCoreClock / 1000u) / elapsed);
        console_putu(kips);
        console_puts(" KIPS\n");
    }

#if RV_ENABLE_JIT
    if (rv_backend == &rv_backend_jit) {
        rv_jit_stats_t js;
        rv_jit_get_stats(&js);
        console_puts("\n-- jit --\n  blocks   ");
        console_putu(js.blocks);
        console_puts("\n  code     ");
        console_putu(js.code_used);
        console_putc('/');
        console_putu(js.code_size);
        console_puts(" bytes\n  blks/xlat ");
        console_putu(js.translations);
        console_puts("\n  compact  ");
        console_putu(js.compactions);
        console_puts(" (");
        console_putu(js.evictions);
        console_puts(" evicted)\n  flushes  ");
        console_putu(js.flushes);
        /*
         * Instructions the translator declined and the interpreter ran.
         * A high share here is the first place to look when the speedup
         * is smaller than expected: it names exactly which encodings are
         * worth teaching the translator next.
         */
        console_puts("\n  interp   ");
        console_putu(js.interp_fallbacks);
        console_puts(" instructions fell back\n  helpers  muldiv ");
        console_putu(js.alu_calls_muldiv);
        console_puts("  clmul ");
        console_putu(js.alu_calls_clmul);
        console_puts("  bit ");
        console_putu(js.alu_calls_bit);
        console_puts("\n  pt hits  ");
        console_putu(js.pt_hits);
        console_puts(" armed ");
        console_putu(js.pt_armed);
        console_puts("\n  blk entr ");
        console_putu(js.block_entries);
        /*
         * Reads per block that uses the register, x100. Below 100 a cache
         * cannot pay: the block would spend a load to save fewer than one.
         */
        {
            static const char *const nm[4] = { "sp", "ra", "a0", "a1" };
            console_puts("\n  reads/blk");
            for (unsigned i = 0; i < 4u; i++) {
                console_putc(' ');
                console_puts(nm[i]);
                console_putc('=');
                if (js.hot_blocks[i] != 0u) {
                    const uint32_t x100 = js.hot_reads[i] * 100u / js.hot_blocks[i];
                    console_putu(x100 / 100u);
                    console_putc('.');
                    console_putu((x100 % 100u) / 10u);
                    console_putu(x100 % 10u);
                } else {
                    console_puts("-");
                }
                console_puts(" in ");
                console_putu(js.hot_blocks[i]);
            }
        }
        console_putc('\n');
    }
#endif

    report_state();

    for (;;) {
        __WFI();
    }
}
